В ходе лабораторной работы необходимо реализовать следующий алгоритм обработки матриц:

- на вход подаются две квадратные симметричные матрицы одинаковой размерности (несимметричные достраиваются до симметричных по главной диагонали)
- матрицы упаковываются в одномерные массивы
- одномерные массивы обрабатываются таким образом, что соответствующие элементы квадратных матриц складываются (без распаковки), в результате получается ещё один одномерный массив, содержащий результаты сложения элементов
- полученный одномерный массив распаковывается в двухмерную матрицу, которая выводится на экран
